Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If the script is intended to stay running in an idle state to monitor for incoming messages, it may be necessary to call the Persistent function to prevent the script from exiting.
ja: スクリプトがアイドル状態で実行され続け、メッセージの着信を監視することを意図している場合、スクリプトの終了を防ぐためにPersistent関数を呼び出す必要がある場合があります。

source: If the script is launched with a version of AutoHotkey that does not support this directive, the error message is something like the following:
ja: このディレクティブをサポートしていないバージョンのAutoHotkeyでスクリプトを起動した場合、以下のようなエラーメッセージが表示されます：

source: If the script is neither compiled nor embedded, this variable defaults to 1, otherwise this variable defaults to 0 but can be overridden by assigning it a value.
ja: スクリプトがコンパイルも 埋め込みもされていない場合、この変数のデフォルトは1です。そうでない場合、この変数のデフォルトは0ですが、値を代入することでオーバーライドできます。

source: If the script is not persistent and this is the last thread, the script will terminate after the thread exits.
ja: スクリプトが永続的でなく、これが最後のスレッドである場合、スクリプトはスレッドが終了した後に終了します。

source: If the script is not persistent for any other reason, it will exit after the last visible GUI is closed; either when the last thread completes or immediately if no threads are running.
ja: 他の理由でスクリプトが持続しない場合、最後に表示されたGUIが閉じられた後に終了します。最後のスレッドが完了したとき、またはスレッドが実行されていない場合は直ちに終了します。

source: If the script is running with restricted privileges due to User Account Control (UAC), any programs it launches will typically also be restricted, even if RunAs is used.
ja: ユーザーアカウント制御（UAC）により制限された権限でスクリプトが実行されている場合、RunAsを使用していても、スクリプトが起動するプログラムも制限されるのが一般的です。

source: If the script is stuck waiting for a window, you will usually need to exit or reload the script to get it unstuck.
ja: スクリプトがウィンドウ待ちでスタックしている場合は、通常、スクリプトを終了するか再読み込みしてスタックを解除する必要があります。

source: If the script itself changes the clipboard, its OnClipboardChange functions are typically not executed immediately; that is, functions immediately below the function that changed the clipboard are likely to execute beforehand.
ja: スクリプト自身がクリップボードを変更する場合、そのOnClipboardChange関数は通常すぐには実行されません。つまり、クリップボードを変更した関数のすぐ下の関数が事前に実行される可能性があります。

source: If the script itself changes the clipboard, the callbacks are typically not executed immediately; that is, statements immediately below the statement that changed the clipboard are likely to execute beforehand.
ja: スクリプト自体がクリップボードを変更したときは、通常、コールバックはすぐには実行されません。つまり、クリップボードを変更したステートメントのすぐ下にあるステートメントは、事前に実行される可能性があります。

source: If the script sent {Alt Down} (such as to invoke the Alt-Tab menu), it might also be necessary to send {Alt Up} as shown in the example further below.
ja: スクリプトで{Alt Down}を送信した場合（Alt-Tabメニューを呼び出すなど）、次の例のように{Alt Up}も送信する必要がある場合があります。

source: If the script text is read from stdin rather than from file, the default value is "*".
ja: スクリプトテキストがファイルからではなく標準入力から読み込まれる場合、デフォルト値は "*"である。

source: If the script text is read from stdin rather than from file, the value is "*".
ja: スクリプトのテキストがファイルからではなく標準入力から読み込まれる場合、値は "*"となる。

source: If the script text is read from stdin rather than from file, this variable contains the initial working directory.
ja: スクリプトテキストがファイルからではなく標準入力から読み込まれる場合、この変数には初期作業ディレクトリが格納される。

source: If the script uses syntax or functions which are unavailable in earlier versions, using this directive ensures that the error message shows the unmet requirement, rather than indicating an arbitrary syntax error.
ja: スクリプトが以前のバージョンでは利用できない構文や関数を使用している場合、このディレクティブを使用すると、エラーメッセージが任意の構文エラーを示すのではなく、満たされていない要件を示すことを保証します。

source: If the script was compiled based on a .bin file, this is the full path and name of the current executable file, the same as A_ScriptFullPath.
ja: スクリプトが.binファイルに基づいてコンパイルされた場合、A_ScriptFullPathと同じ、現在の実行可能ファイルのフルパスと名前です。

source: If the script was loaded from an external file, this is the same as A_ScriptFullPath unless the line belongs to one of the script's #Include files.
ja: スクリプトが外部ファイルからロードされた場合、その行がスクリプトの#Includeファイルのいずれかに属していなければ、これはA_ScriptFullPathと同じです。

source: If the script's process has no debugger, the system debugger displays the string.
ja: スクリプトのプロセスにデバッガがない場合、システムデバッガが文字列を表示します。

source: If the second parameter is omitted, it is equivalent to FileObj.Pos := Distance.
ja: 第2パラメータが省略された場合は、FileObj.Pos := Distanceと等価となる。

source: If the second parameter is omitted, the type of icons in the ImageList is detected automatically as large or small.
ja: 第2パラメータを省略した場合、ImageListに含まれるアイコンの種類を自動的に大小判別します。

source: If the second parameter is zero, a ZeroDivisionError is thrown.
ja: 第2パラメータが0である場合、ZeroDivisionErrorが投げられる。

source: If the section already exists, everything up to the last key=value pair is overwritten.
ja: セクションが既に存在する場合は、最後のkey=valueペアまでが上書きされます。

source: If the shortcut uses only the standard modifier key names Ctrl, Alt and Shift, it is automatically registered as a keyboard accelerator for the GUI.
ja: ショートカットが標準的な修飾キー名であるCtrl、Alt、Shiftのみを使用する場合、GUI用のキーボードアクセラレータとして自動的に登録されます。

source: If the sign is omitted, a plus sign is assumed.
ja: 符号を省略した場合は、プラス符号とします。

source: If the size is decreased, the data within the buffer is truncated, but the remaining bytes are preserved.
ja: サイズが小さくなった場合、バッファ内のデータは切り捨てられますが、残りのバイトは保存されます。

source: If the size is increased, all data is preserved and the values of any new bytes are arbitrary (they are not initialized, for performance reasons).
ja: サイズが大きくなっても、すべてのデータは保存され、新しいバイトの値は任意です（パフォーマンス上の理由から、初期化されません）。

source: If the software is modified by someone else and passed on, we want its recipients to know that what they have is not the original, so that any problems introduced by others will not reflect on the original authors' reputations.
ja: もし、そのソフトウェアが他の人によって改変され、受け継がれることになったとしても、私たちは、そのソフトウェアを受け取った人たちに、そのソフトウェアがオリジナルではないことを知ってもらいたいのです。

source: If the sound card is not available, the sound is generated using the speaker.
ja: サウンドカードが使用できない場合、サウンドはスピーカーを使用して生成されます。

source: If the sound device lacks the specified Component, a TargetError is thrown.
ja: サウンドデバイスに指定されたコンポーネントがない場合、TargetErrorがスローされます。

source: If the source and destination are on different volumes or UNC paths, a copy/delete operation will be performed rather than a move.
ja: 移動元と移動先が異なるボリュームまたはUNCパスにある場合は、移動ではなく、コピー/削除操作が実行されます。

source: If the source directory contains any saved webpages consisting of a PageName.htm file and a corresponding directory named PageName_files, an exception may be thrown even when the copy is successful.
ja: コピー元のディレクトリに、PageName.htmファイルとそれに対応するPageName_filesという名前のディレクトリからなる保存されたウェブページがある場合、コピーに成功しても例外が発生することがあります。

source: If the source encoding was specified correctly, the return value always uses the native encoding.
ja: ソース・エンコーディングが正しく指定されていれば、返り値は常にネイティブ・エンコーディングを使用する。

source: If the source variant type is not equal to VarType, conversion is attempted by calling VariantChangeType with a wFlags value of 0.
ja: ソースバリアントタイプがVarTypeと等しくない場合、wFlagsの値0を持つVariantChangeTypeを呼び出すことで変換が試みられます。

source: If the specified environment variable is empty or does not exist, an empty string is returned.
ja: 指定された環境変数が空または存在しない場合は、空の文字列が返されます。

source: If the specified process is discovered, this function returns the Process ID (PID) of the process.
ja: 指定されたプロセスが発見された場合、そのプロセスのプロセス ID（PID）を返す。

source: If the string begins with a Unicode supplementary character, this function returns the corresponding Unicode character code (a number between 0x10000 and 0x10FFFF).
ja: 文字列がUnicode補助文字で始まる場合、対応するUnicode文字コード（0x10000から0x10FFFFの間の数値）を返します。

source: If the string contained by a variable is changed by passing the variable's address to SendMessage, the variable's length must be updated afterward by calling VarSetStrCapacity(&MyVar, -1).
ja: SendMessageに変数のアドレスを渡して変数が含む文字列を変更した場合、その後VarSetStrCapacity(&MyVar, -1)を呼び出して変数の長さを更新する必要があります。

source: If the string is empty, zero is returned.
ja: 文字列が空の場合は、0を返します。

source: If the string matches multiple items in a multi-select ListBox, Choose() selects them all, not just the first.
ja: 文字列が複数選択リストボックスの複数の項目に一致する場合、Choose()は最初の項目だけでなく、すべての項目を選択します。

source: If the structure contains additional information about the notification, the callback can retrieve it with NumGet and/or StrGet.
ja: 構造体が通知に関する追加情報を含む場合、コールバックはNumGetおよび/またはStrGetでそれを取得することができます。

source: If the system debugger is not active, this function has no effect.
ja: システムデバッガがアクティブでない場合、この機能は何の効果もありません。

source: If the system has stopped calling the hook due to an unresponsive program, reinstalling the hook might get it working again.
ja: プログラムが反応しないためにシステムがフックを呼び出さなくなった場合、フックを再インストールすることで再び動作するようになる場合があります。

source: If the system timeout value is exceeded, the system may stop calling the script's keyboard hook, thereby preventing hook hotkeys from working until the hook is re-registered or the script is reloaded.
ja: システムのタイムアウト値を超えると、スクリプトのキーボードフックの呼び出しが停止し、フックが再登録されるかスクリプトが再読み込みされるまで、フックのホットキーが動作しなくなる場合があります。

source: If the system was to detect only a Win or Alt keydown and keyup with no intervening keypress, it would usually activate a menu.
ja: もし、WinやAltのキーダウンとキーアップだけを検出し、その間にキー入力がなければ、通常はメニューを起動します。

source: If the system's version of Comctl32.dll is older than 5.8, this style is not supported and DTS_SHORTDATEFORMAT is automatically substituted.
ja: システムのComctl32.dllのバージョンが5.8より古い場合、このスタイルはサポートされず、DTS_SHORTDATEFORMATが自動的に代用される。

source: If the target control is an Edit control (or something similar), the following are usually more reliable and faster than ControlSend:
ja: ターゲットコントロールがEditコントロールまたはそれに類するものであるときは、通常ControlSend関数よりも以下の方が信頼性が高く高速です：

source: If the target file is a directory, the size will be reported as whatever the OS believes it to be (probably zero in all cases).
ja: 対象ファイルがディレクトリの場合、OSが考えるサイズとして報告されます（おそらくすべての場合においてゼロ）。

source: If the target function uses the values initially in the structure, call NumPut("UInt", 123, MyStruct, 4) to initialize any members that should be non-zero.
ja: ターゲット関数が構造体の初期値を使用する場合は、NumPut("UInt", 123, MyStruct, 4)を呼び出して、0 以外の値を持つべきメンバーを初期化します。

source: If the target value cannot be called due to one of the reasons below, an Error is thrown:
ja: 以下の理由により、目標値を呼び出すことができない場合は、Errorが発生します：

source: If the target value is not of a type that can be called, a MethodError is thrown.
ja: ターゲット値が呼び出し可能な型でない場合、MethodErrorが投げられる。

source: If the target window does not receive the keystrokes reliably, try increasing the press duration via the second parameter of SetKeyDelay as in these examples:
ja: ターゲットウィンドウが確実にキー入力を受け取れない場合は、以下の例のようにSetKeyDelayの第2パラメータで押下時間を長くしてみてください：

source: If the template script needs to #include other files, they can be placed in a subdirectory to avoid having them shown in the template list.
ja: テンプレートスクリプトが他のファイルを#includeする必要がある場合、それらをサブディレクトリに置くことで、テンプレートリストに表示されないようにすることができる。

source: If the text being searched contains multiple lines, the anchors can be made to apply to each line rather than the text as a whole by means of the "m" option.
ja: 検索対象のテキストが複数の行を含む場合、「m」オプションを使って、アンカーをテキスト全体ではなく各行に適用させることができる。

source: If the text is long, it can be broken up into several shorter lines by means of a continuation section, which might improve readability and maintainability.
ja: 文章が長い場合は、続きの部分によっていくつかの短い行に分割することで、読みやすさや保守性を向上させることができるかもしれません。

source: If the tilde prefix is applied only to the custom combination and not the non-combination hotkey, the key's native function will still be blocked.
ja: チルダ接頭辞がカスタムコンビネーションにのみ適用され、コンビネーション以外のホットキーには適用されない場合、そのキーのネイティブ機能はブロックされたままとなります。

source: If the tilde prefix is applied to a custom modifier key (prefix key) which is also used as its own hotkey, that hotkey will fire when the key is pressed instead of being delayed until the key is released.
ja: ホットキーとして使用されるカスタム修飾キー（プレフィックスキー）にチルダプレフィックスを適用した場合、そのホットキーはキーを離すまで遅延されるのではなく、キーを押したときに起動するようになります。

source: If the timeout value is exceeded, the expression continues to evaluate, but the keyboard hook continues as if the expression had already returned false.
ja: タイムアウト値を超えた場合、式の評価は継続されますが、キーボードフックは式がすでにfalseを返したかのように続行されます。

source: If the timer is being modified or deleted from within a function/method called by the timer, it may be easier to omit the Function parameter.
ja: タイマーが呼び出された関数/メソッド内でタイマーを変更または削除する場合、Functionパラメータを省略する方が簡単な場合があります。

source: If the tray menu becomes empty, right-clicking and double-clicking the tray icon will have no effect (in such cases it is usually better to use #NoTrayIcon).
ja: トレイメニューが空になると、トレイアイコンを右クリックやダブルクリックしても効果がありません（このような場合は、通常#NoTrayIconを使用する方がよいでしょう）。

source: If the tray menu contains standard items, &Open is inserted or removed whenever A_AllowMainWindow is changed.
ja: トレイメニューに標準項目が含まれている場合、A_AllowMainWindowが変更されるたびに、&Openが挿入または削除されます。

source: If the tray was recently closed, there may be a delay before the function completes.
ja: トレイを最近閉じた場合は、機能が完了するまでに時間がかかることがあります。

source: If the user cancels the User Account Control (UAC) dialog or Run fails for some other reason, the script will simply exit.
ja: ユーザーがユーザーアカウント制御（UAC）ダイアログをキャンセルしたとき、またはその他の理由で実行に失敗したときは、スクリプトは終了します。

source: If the user cancels the UAC dialog or Run fails for some other reason, the script will simply exit.
ja: ユーザーがUACダイアログをキャンセルした場合、またはその他の理由でRunに失敗した場合、スクリプトは単に終了します。

source: If the user cancels the dialog (i.e. does not wish to select a folder), an empty string is returned.
ja: ユーザーがダイアログをキャンセルした場合（フォルダの選択を希望しない場合）には、空文字列が返されます。

source: If the user cancels the dialog, the array is empty (has zero items).
ja: ユーザーがダイアログをキャンセルした場合、配列は空（アイテムがゼロ）になります。

source: If the user cancels, the array is empty.
ja: ユーザーがキャンセルした場合は、配列は空になります。

source: If the user clicks on an invisible pixel, the click will "fall through" to the window behind it.
ja: ユーザーが不可視のピクセルをクリックすると、そのクリックは背後のウィンドウに「フォールスルー」される。

source: If the user holds down Ctrl while selecting an item, the item being unselected will not be collapsed.
ja: ユーザーがCtrlを押しながら項目を選択した場合、選択されていない項目は折りたたまれません。

source: If the user selects a root directory (such as C:\), the return value will contain a trailing backslash.
ja: ユーザーがルートディレクトリ（C:\）を選択した場合、戻り値には末尾のバックスラッシュが含まれます。

source: If the user swaps the buttons via system settings, the physical positions of the buttons are swapped but the effect stays the same.
ja: ユーザーがシステム設定でボタンを入れ替えると、ボタンの物理的な位置は入れ替わりますが、効果は変わりません。

source: If the user types an invalid folder name in the edit field, SelectedFolder will be set to the folder selected in the navigation tree rather than what the user entered.
ja: ユーザーが編集フィールドに無効なフォルダ名を入力した場合、SelectedFolderはユーザーが入力したものではなく、ナビゲーションツリーで選択されたフォルダに設定されます。

source: If the value cannot be converted, a TypeError is thrown.
ja: 値を変換できない場合、TypeErrorがスローされます。

source: If the value cannot be retrieved, the default value indicated by the Default parameter is returned.
ja: 値が取得できない場合は、Defaultパラメータで示されるデフォルト値が返されます。

source: If the value is a string, any numeric color value must be in hexadecimal format.
ja: 値が文字列の場合、色の数値は16進数です。

source: If the value is not an instance of any of the listed classes, it is not caught by this Try-Catch, but might be caught by one further up the call stack.
ja: 値がリストアップされたクラスのインスタンスでない場合、このTry-Catchでは捕らえられませんが、コールスタックのさらに上のクラスで捕らえることができるかもしれません。

source: If the value is not an instance of any of the listed classes, it is not caught by this try-catch, but might be caught by one further up the call stack.
ja: 値がリストアップされたクラスのインスタンスでない場合、このトライキャッチでは捕らえられませんが、コールスタックのさらに上のクラスで捕らえることができるかもしれません。

source: If the variable contains the entire command line, simply pass the variable to the Run function to execute it.
ja: 変数にコマンドライン全体が含まれている場合は、その変数をRun関数に渡すだけで実行できます。

source: If the variable is not null-terminated upon return, an error message is shown and the program exits as it is likely that memory has been corrupted via buffer overrun.
ja: 戻り時に変数がヌル終端でない場合は、バッファオーバーランによりメモリが破壊された可能性が高いので、エラーメッセージを表示してプログラムを終了します。

source: If the variable really was intended to be local, a declaration such as local x or static y can be used to suppress the warning.
ja: もし本当にローカルな変数であることを意図していたのであれば、local xやstatic yなどの宣言を用いて警告を抑制することができます。

source: If the variable's value never changes after the hotkey is created, there are two strategies for minimizing the risk of lag or other issues inherent to #HotIf:
ja: ホットキー作成後に変数の値が変化しない場合、ラグなど#HotIf特有の問題のリスクを最小化するための戦略が2つあります：

source: If the week containing January 1st has four or more days in the new year, it is considered week 1.
ja: 新年1月1日を含む週が4日以上ある場合は、第1週とします。

source: If the wheel is being turned quickly (depending on the type of mouse), A_EventInfo may be greater than 120.
ja: マウスの種類によっては）ホイールを素早く回している場合、A_EventInfoが120より大きくなる場合があります。

source: If the window cannot be determined, this variable will be made blank.
ja: ウィンドウを決定できない場合、この変数は空白になります。

source: If the window does not already have a custom system menu, a copy of the standard system menu will be created and assigned to the target window as a side effect.
ja: ウィンドウにカスタムシステムメニューがまだない場合、標準システムメニューのコピーが作成され、副作用としてターゲットウィンドウに割り当てられます。

source: If the window does not close within that period, the script will continue.
ja: その期間内にウィンドウが閉じなければ、スクリプトは続行されます。

source: If the window is already active, it will be kept active rather than activating any other matching window beneath it.
ja: ウィンドウがすでにアクティブになっている場合、その下にある他のマッチするウィンドウをアクティブにするのではなく、アクティブな状態を維持する。

source: If the window is hidden but not a GUI window (such as the script's main window), turn on DetectHiddenWindows before using it.
ja: ウィンドウが隠れていてもGUIウィンドウ（スクリプトのメインウィンドウなど）でない場合は、DetectHiddenWindowsをオンにしてから使用します。

source: If the window is minimized and inactive, it is automatically restored prior to being activated.
ja: ウィンドウが最小化されて非アクティブになると、アクティブになる前に自動的に復元される。

source: If the window is minimized, it will stay that way but will probably rise higher in the z-order (which is the order seen in the alt-tab selector).
ja: ウィンドウが最小化された場合、その状態を維持しますが、おそらくzオーダー（alt-tabセレクタで見られる順序）でより高く上昇します。

source: If the window still fails to be redrawn correctly, see WinRedraw for a possible workaround.
ja: それでもウィンドウが正しく再描画されない場合は、WinRedrawを参照してください。

source: If the window was previously hidden, this will probably cause it to appear on top of the active window even though the active window is not deactivated.
ja: ウィンドウが以前は隠れていた場合、アクティブなウィンドウが非アクティブになっていないにもかかわらず、ウィンドウがアクティブなウィンドウの上に表示されてしまうことが考えられます。

source: If the word Join is specified by itself, lines are connected directly to each other without any characters in between.
ja: Joinという単語が単独で指定された場合、行と行の間は文字なしで直接接続される。

source: If the working directory exceeds MAX_PATH, it becomes impossible to launch programs with Run.
ja: 作業ディレクトリがMAX_PATHを超えると、Runでプログラムを起動できなくなる。

source: If there are any adjoining %Expr% sequences and partial names (without any spaces or other characters between them), they are combined to form a single name.
ja: %Expr%シーケンスと部分名（間にスペースや他の文字を含まない）が隣接している場合、それらは結合されて1つの名前になります。

source: If there are any competing directives overall, the last encountered by the compiler will be used.
ja: 全体として競合するディレクティブがあれば、コンパイラが最後に見つけたものが使われる。

source: If there are multiple functions monitoring a given message number, they are called one by one until one returns a non-empty value.
ja: 与えられたメッセージ番号を監視する関数が複数ある場合は、1つが空でない値を返すまで、1つずつ呼び出されます。

source: If there are multiple instances (such as if previous instances of the script used the #SingleInstance Off mode), the topmost matching instance is sent the message, and other instances are not considered.
ja: 複数のインスタンスが存在する場合（以前のスクリプトのインスタンスが#SingleInstance Offモードを使用していた場合など）、一番上にマッチしたインスタンスにメッセージが送信され、他のインスタンスは考慮されません。

source: If there are no children, 0 is returned instead of the ID of the modified item.
ja: 子供がいない場合は、変更された項目のIDの代わりに0が返される。

source: If there are no children, the Modify method returns 0 instead of the item's ID.
ja: 子供がいない場合、Modify メソッドはアイテムの ID ではなく 0 を返します。

source: If there are no components, an empty string is returned.
ja: 構成要素がない場合は、空文字列が返されます。

source: If there are no options, the ")" is optional; for example, )abc is equivalent to abc.
ja: オプションがない場合、「）」はオプションです。例えば、)abcはabcと同等です。

source: If there are too few fields to fill all the columns, the columns at the end are left blank.
ja: フィールドが少なすぎてすべての列を埋めることができない場合、末尾の列は空白になります。

source: If there are too few parameters to cover all the columns, the columns at the end are not changed.
ja: パラメータが少なすぎてすべての列をカバーできない場合、末尾の列は変更されません。

source: If there are too many fields, the fields at the end are completely ignored.
ja: フィールドが多すぎる場合、末尾のフィールドは完全に無視されます。

source: If there is a Catch statement which matches the class of the thrown value, execution is transferred into it.
ja: スローされた値のクラスと一致するCatch文があれば、その文が実行されます。

source: If there is a control at the specified coordinates, it will be sent the click-event at those exact coordinates.
ja: 指定された座標にコントロールがある場合、その正確な座標でクリックイベントを送信します。

source: If there is a return value, it is always discarded.
ja: 戻り値がある場合は、必ず破棄されます。

source: If there is both a key-down hotkey and a key-up hotkey, both hotkeys are fired at once.
ja: キーダウンホットキーとキーアップホットキーが両方ある場合、両方のホットキーが同時に起動します。

source: If there is concern about using too much memory, check the file size beforehand with FileGetSize.
ja: メモリの使いすぎが懸念される場合は、FileGetSizeで事前にファイルサイズを確認してください。

source: If there is no Else, an OSError is thrown if the file could not be found.
ja: Elseがない場合、ファイルが見つからなかった場合はOSErrorが投げられる。

source: If there is no active window or the caret position cannot be determined, the function returns 0 (false) and the output variables are made blank.
ja: アクティブなウィンドウがない場合、またはキャレット位置が決定できない場合、この関数は0（偽）を返し、出力変数は空白にされます。

source: If there is no base, the return value is an empty string.
ja: ベースがない場合、戻り値は空文字列となる。

source: If there is no button selected, 0 is stored.
ja: 選択されているボタンがない場合は、0が格納されます。

source: If there is no caller to which to return, Return will do an Exit instead.
ja: 戻るべき呼び出し元がない場合、Returnは代わりにExitを行います。

source: If there is no control, the target window itself will be sent the event (which might have no effect depending on the nature of the window).
ja: コントロールがない場合は、対象のウィンドウ自体にイベントが送られます（ウィンドウの性質によっては、何の効果もない場合もあります）。

source: If there is no default value (that is, if RegEdit displays "value not set"), an OSError is thrown.
ja: デフォルト値がない場合（つまり、RegEditが「value not set」と表示した場合）、OSErrorが投げられる。

source: If there is no default, double-clicking has no effect.
ja: デフォルトがない場合、ダブルクリックしても効果はありません。

source: If there is no matching Catch statement but there is a Finally statement, it is executed, but once it finishes the value is automatically thrown again.
ja: 一致するCatch文がないがFinally文があるときは、その文が実行されますが、それが終了すると、値が自動的に再びスローされます。

source: If there is no matching Catch statement or Finally statement, the value is automatically thrown again (unless there is no Catch or Finally at all, as noted above).
ja: 一致するCatch文またはFinally文がない場合、値は自動的に再度スローされる（前述のようにCatchまたはFinallyがまったくない場合を除く）。

source: If there is no matching case and Default is present, it is executed.
ja: 一致するケースがなく、Defaultが存在する場合、そのケースが実行される。

source: If there is no matching case and a Default is present, it is executed.
ja: 一致するケースがなく、デフォルトが存在する場合、そのケースが実行される。

source: If there is no matching item, the result is zero even if there is text in the control.
ja: 一致する項目がない場合、コントロール内にテキストがあっても結果は0となります。

source: If there is no matching process, zero is returned.
ja: 一致する処理がない場合は、0が返されます。

source: If there is no matching window, an empty array is returned.
ja: マッチするウィンドウがない場合は、空の配列が返される。

source: If there is no matching window, an empty string is returned.
ja: マッチするウィンドウがないときは、空文字列が返されます。

source: If there is no matching window, zero is returned.
ja: 一致するウィンドウがないときは、0を返します。

source: If there is no previous position, the window will be auto-centered in one or both dimensions if the X and/or Y options mentioned below are absent.
ja: 前の位置がない場合、後述のXおよびYオプションがなければ、ウィンドウは1次元または両次元で自動中心化されます。

source: If there is no previous size, the window will be auto-sized according to the size and positions of the controls it contains.
ja: 以前のサイズがない場合、ウィンドウは、それが含むコントロールのサイズと位置に応じて自動サイズになります。
